INSERT INTO students (
    name, kana_name, nickname, email, area, age, sex, remark, i_deleted
) VALUES
    ( '山田太郎', 'ヤマダタロウ', 'タロ', 'taro@example.com', '東京', 26, '男性', '簿記3級', 0),
    ( '鈴木一郎', 'スズキイチロウ', 'イチ', 'ichiro@example.com', '大阪', 30, '男性', '元自衛隊員,小型機と小型船の免許保有', 0),
    ( '田中花子', 'タナカハナコ', 'ハナ', 'hana@example.com', '北海道', 22, '女性', 'TOEIC:スコア605点', 0),
    ( '佐藤良子', 'サトウリョウコ', 'リョウ', 'ryoko@example.com', '福岡', 28, '女性', '公務員資格とショベルカーの免許保有', 0),
    ( '伊藤悠', 'イトウハルカ', 'ハル', 'haruka@example.com', '愛知', 35, 'その他', 'TOEIC:スコア910点　中国語、韓国語得意', 0),
    ( 'ジャバ太郎', 'ジャバタロウ', 'タロウ', 'aaaa0000@example.com', '新潟', 22, '男', '特になし。', 0),
    ( '江並公史', 'エナミコウジ', 'コウジ', 'cccc2222@example.com', '奈良', 36, '男', '元蜂蜜工場の養殖ミツバチの飼育員', 1),
    ( 'コマンドプロンプト文子', 'コマンドプロンプトフミコ', 'フミ', 'bbbb1111@example.com', '新潟', 42, '女', '簿記2級', 1),
    ( '江並ポストマン三郎', 'エナミポストマンサブロウ', 'サブロウ', 'saburo@example.com', '奈良', 30, '男性', 'フグ料理の免許有', 0),
    ( '江並公史', 'エナミコウジ', 'コウジ', 'cccc2222@example.com', '奈良', 36, '男', '元蜂蜜工場の養殖ミツバチの飼育員', 1),
    ( '江並公史', 'エナミコウジ', 'コウジ', 'cccc2222@example.com', '奈良', 36, '男', '元蜂蜜工場の養殖ミツバチの飼育員', 1),
    ( '江並公史', 'エナミコウジ', 'コウジ', 'cccc2222@example.com', '奈良', 36, '男', '元蜂蜜工場の養殖ミツバチの飼育員', 1);


INSERT INTO students_courses (
    student_id, course_name, course_start_at, course_end_at
) VALUES
    ( 1, 'Javaコース', '2023-04-01 09:00:00', '2023-07-01 15:00:00'),
    ( 1, 'AWSコース', '2023-05-01 10:00:00', '2023-08-01 16:00:00'),
    ( 2, 'デザインコース', '2023-06-01 11:00:00', '2023-09-01 17:00:00'),
    ( 3, 'Web制作コース', '2023-07-01 12:00:00', '2023-10-01 18:00:00'),
    ( 3, 'デザインコース', '2023-08-01 13:00:00', '2023-11-01 19:00:00'),
    ( 3, 'マーケティングコース', '2023-09-01 09:00:00', '2024-01-01 15:00:00'),
    ( 4, 'Javaコース', '2023-10-01 10:00:00', '2024-02-01 16:00:00'),
    ( 4, 'マーケティングコース', '2023-11-01 11:00:00', '2024-03-01 17:00:00'),
    ( 5, 'AWSコース', '2023-12-01 12:00:00', '2024-04-01 18:00:00'),
    ( 1, 'Web制作コース', '2024-01-01 13:00:00', '2024-05-01 19:00:00'),
    ( 9, 'Javaコース', NULL, NULL),
    ( 12, 'AWSコース', NULL, NULL);
